---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.StructuralAnalysis
source: html/7def2758-b400-4337-0e8d-575ba4e66084.htm
---
# Autodesk.Revit.DB.GroupTypeId.StructuralAnalysis Property

Structural Analysis.

## Syntax (C#)
```csharp
public static ForgeTypeId StructuralAnalysis { get; }
```